[
  {
    "path": "posts/2021-07-08-the-fascinating-world-of-voronoi-diagrams/",
    "title": "The fascinating world of Voronoi diagrams",
    "description": "In this article I explain what is a Vornoi diagram and why they are amazing",
    "author": [
      {
        "name": "Francesco S. Bellelli",
        "url": {}
      }
    ],
    "date": "2021-07-08",
    "categories": [
      "maths",
      "other"
    ],
    "contents": "\r\n\r\nContents\r\nWhat is a Voronoi diagram?\r\nVornoi patterns are ubiquitous\r\nVoronoi patterns in nature\r\nVoronoi pattern in architecture and arts\r\n\r\nMathematical definition and some interesting properties\r\nDelaunay triangulation\r\nLloyds relaxation algorithm\r\n\r\n\r\n\r\n\r\nVornoi diagrams (also known as Dirichlet tesselation or Thiessen polygons) are everywhere in nature. You have encountered them thousands of times, but maybe did not call it this way. Voronoi diagram are simple, yet they have incredible properties which have found applications in fields ranging from cartography, biology, computer science, statistics, archaeology, all way to architecture and arts.\r\nWhat is a Voronoi diagram?\r\nSuppose you have \\(n\\) points scattered on a plane, the Voronoi diagram of those points subdivides the plane in exactly \\(n\\) cells enclosing the portion of the plane that is the closest to the each point. This produces a tessellation that completely covers the plane. As an illustration, in Figure 1, I plotted 100 random points and their corresponding Voronoi diagram. As you can see, every point is enclosed in a cell, whose boundaries are exactly equidistant between two or more points. In other words, the cells shows\r\n\r\n\r\n\r\nFigure 1: Voronoi diagram from 100 random points in a plane\r\n\r\n\r\n\r\nVornoi patterns are ubiquitous\r\nVoronoi patterns in nature\r\nThe pattern created by Vornoi diagrams is a common one in nature. In Figure 3, I made a small collage of some naturally occurring Vornoi-like patterns. From microscopic cells in onion skins, to the shell of jackfruits and the coat of giraffes. These patterns are everywhere!\r\nA first reason for their omnipresence is that they form efficient shapes. As we mentioned earlier, Vornoi diagram completely tessellates the plan: hence, all space is used. This is very convenient if you are trying to squeeze as much as possible in a limited space — such as in muscle fibres or bee hives. Secondly, Vornoi diagrams are a spontaneous pattern whenever something is growing at uniform growth rates from separate points (see Figure 2). For instance, this explains giraffe exhibit such patterns. Giraffe embryos have a scattered distribution of melanin-secreting cells, which is responsible for the dark pigmentation of the giraffe’s spots. Over the course of the gestation these cells release melanin — hence spots radiate outward. Interested reader may refer to this paper, in which the authors use Vornoi diagrams to model computer rendering of spots on animals coats.\r\n\r\n\r\n\r\nFigure 2: A Vornoi diagram is obtained from constant outward growth from dispered pointsSource: Wikipedia\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 3: Voronoi patterns are everywhere in nature. (From top-left to bottom right: microscope view of onion skin cells, cross-section of a muscle, garlic bulb, wings of a dragonfly, soap bubbles, close-up of a leaf, giraffes coat patterns, corns, jackfruits hanging from a tree.)\r\n\r\n\r\n\r\nVoronoi pattern in architecture and arts\r\nPerhaps because of their spontaneous “natural” look, or simply because of their mesmerising randomness, Vornoi patterns have intentionally been implemented in human-made structures. An architectural example is the “Water cube” built to house the water sports during the 2008 Beijing Olympics. It features Voronoi diagrams on its ceiling and façades (Figure 4). The Vornoi diagrams were chosen because they recall bubbles. This analogy is very clear at night, when the entire façade is illumanated in blue and comes alive.\r\n\r\n\r\n\r\nFigure 4: Water cube in Beijing\r\n\r\n\r\n\r\nBut Chinese appreciation of Vornoi pattern is surely older than this building. Guan and Ge ware from the Song dynasty have a distinctive crackled glaze. Ceramics can easily crack during the cooling process, however the crackles from the Guan and Ge ware are different — they are intentional. They are sought after because of their aesthetic qualities. Thanks to the Vornoi-like patterns on their surface, each piece is unique. To date, this is one of the most imitated styles of porcelain (Figure 5).\r\n\r\n\r\n\r\nFigure 5: Guan and Ge wares\r\n\r\n\r\n\r\nVornoi diagrams are also common in graphic arts for creating “abstract” patterns. I think they make excellent background images. For example, I created the thumbnail of this post by generating random points and constructing a Voronoi diagram. Then, I coloured each cell based on the distance of its point from a randomly selected spot in the box (Figure 6). Endless “abstract” backgrounds images could be generated this way.\r\n\r\n\r\n\r\nFigure 6: Coloured Vornoi diagram\r\n\r\n\r\n\r\nMathematical definition and some interesting properties\r\nSo far, we have presented a simple two-dimensional Vornoi diagram. However, the same type of structure can be generalised to an \\(n\\)-dimensional space. Suppose \\(P=\\{p_1,p_2,...,p_m\\}\\) is a set of \\(m\\) points in our n-dimensional space. Then, the space can be partitioned in \\(m\\) Vornoi cells, \\(V_i\\), containing all points in \\(\\mathbb{R}^n\\) that are closer to \\(p_i\\) than to any other point.\r\n\\[V_i = \\left\\{x : \\forall j \\neq i, d(x, p_i) \\leq d(x,p_j)\\right\\} \\text{, with } i,j \\in \\{1,2,...,m\\}\\] Where the function \\(d(x,y)\\) gives the distance (\\(a\\)) between its two arguments. Typically, the Euclidean distance is used (\\(l^2\\) distance):\r\n\\[d(x,y)=||x-y||_2=\\sqrt{\\sum_{k=1}^{n}(x_k-y_k)^2}\\] However, Vornoi diagrams could be designed using other distance functions. For instance, Figure 7 shows a Vornoi diagram obtained with the Manhattan or cityblock distance (\\(l^1\\) distance). The Manahattan distance is the distance between two points if you had to follow a regular grid — such as the city blocks of Manhattan. The result is a more “boxy” Vornoi diagram. \\[d(x,y)=||x-y||_1=\\sum_{k=1}^{n}{|x_k-y_k|}\\]\r\n\r\n\r\n\r\nFigure 7: Euclidean and Manhattan distanceSource:Johnson Hsieh\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 8: Comparison of Vornoi diagrams using the Euclidean (left) and Manhattan (right) distance for a same set of pointsSource: Wikipedia\r\n\r\n\r\n\r\nEuclidean distance is the most common distance measure in scientific applications of the Voronoi diagram. It also has the advantage of generating Vornoi cells that are convex. That is to say, if you take any two points within a cell, the line that connects the two points will lie entirely within the cell.\r\nFinally, it should also be noted that Vornoi diagrams are tightly linked with the k-nearest neighbours algorithm (k-NN) — a very popular algorithm in classification, regression and clustering problems. The algorithm uses the \\(k\\) closest examples in the training dataset to make value predictions. Since the Vornoi diagrams partitions the space in polygons containing the closest points to each seed, the edges of Vornoi cells correspond exactly to the decision boundaries of a simple 1-nearest neighbour problem.\r\nDelaunay triangulation\r\nIf you take each of the points from a Vornoi diagram and link it with the points in its neighbouring cells, you will obtain a graph called Delaunay triangulation. In mathematical terms, the Delaunay triangulation is the dual graph of the Vornoi diagram. In the Figure below, a Vornoi diagram (black) and Delaunay triangulation (grey) is plotted from a set of points. By moving the mouse over the image, one can explore how they are affected by a new point.\r\n\r\n\r\n\r\n{\"x\":{\"data\":null,\"type\":\"NULL\",\"container\":\"svg\",\"options\":null,\"script\":\"var d3Script = function(d3, r2d3, data, svg, width, height, options, theme, console) {\\nthis.d3 = d3;\\n\\nsvg = d3.select(svg.node());\\n/* R2D3 Source File:  d3/voronoi.js */\\n// !preview r2d3 d3_version = 4\\n\\n// Based on: https://bl.ocks.org/mbostock/4060366\\n\\nsvg.on(\\\"touchmove mousemove\\\", moved);\\n\\nvar sites = d3.range(100)\\n    .map(function(d) { return [Math.random() * width, Math.random() * height]; });\\n\\nvar voronoi = d3.voronoi()\\n    .extent([[-8, -8], [width + 8, height + 8]]);\\n\\nvar polygon = svg.append(\\\"g\\\")\\n    .attr(\\\"class\\\", \\\"polygons\\\")\\n  .selectAll(\\\"path\\\")\\n  .data(voronoi.polygons(sites))\\n  .enter().append(\\\"path\\\")\\n    .call(redrawPolygon);\\n\\nvar link = svg.append(\\\"g\\\")\\n    .attr(\\\"class\\\", \\\"links\\\")\\n  .selectAll(\\\"line\\\")\\n  .data(voronoi.links(sites))\\n  .enter().append(\\\"line\\\")\\n    .call(redrawLink);\\n\\nvar site = svg.append(\\\"g\\\")\\n    .attr(\\\"class\\\", \\\"sites\\\")\\n  .selectAll(\\\"circle\\\")\\n  .data(sites)\\n  .enter().append(\\\"circle\\\")\\n    .attr(\\\"r\\\", 2.5)\\n    .call(redrawSite);\\n\\nfunction moved() {\\n  sites[0] = d3.mouse(this);\\n  redraw();\\n}\\n\\nfunction redraw() {\\n  var diagram = voronoi(sites);\\n  polygon = polygon.data(diagram.polygons()).call(redrawPolygon);\\n  link = link.data(diagram.links()), link.exit().remove();\\n  link = link.enter().append(\\\"line\\\").merge(link).call(redrawLink);\\n  site = site.data(sites).call(redrawSite);\\n}\\n\\nfunction redrawPolygon(polygon) {\\n  polygon\\n      .attr(\\\"d\\\", function(d) { return d ? \\\"M\\\" + d.join(\\\"L\\\") + \\\"Z\\\" : null; });\\n}\\n\\nfunction redrawLink(link) {\\n  link\\n      .attr(\\\"x1\\\", function(d) { return d.source[0]; })\\n      .attr(\\\"y1\\\", function(d) { return d.source[1]; })\\n      .attr(\\\"x2\\\", function(d) { return d.target[0]; })\\n      .attr(\\\"y2\\\", function(d) { return d.target[1]; });\\n}\\n\\nfunction redrawSite(site) {\\n  site\\n      .attr(\\\"cx\\\", function(d) { return d[0]; })\\n      .attr(\\\"cy\\\", function(d) { return d[1]; });\\n}\\n};\",\"style\":\"/* R2D3 Source File:  d3/voronoi.css */\\n.links {\\n  stroke: #000;\\n  stroke-opacity: 0.2;\\n}\\n\\n.polygons {\\n  fill: none;\\n  stroke: #000;\\n  stroke-opacity: 1;\\n}\\n\\n.polygons :first-child {\\n  fill: #f00;\\n  fill-opacity: 0.4;\\n}\\n\\n.sites {\\n  fill: #000;\\n  stroke: #fff;\\n}\\n\\n.sites :first-child {\\n  fill: #fff;\\n}\",\"version\":4,\"theme\":{\"default\":{\"background\":\"#FFFFFF\",\"foreground\":\"#000000\"},\"runtime\":null},\"useShadow\":true},\"evals\":[],\"jsHooks\":[]}\r\nFigure 9: Vornoi diagram and Delaunay triangulationSource: r2d3\r\n\r\n\r\n\r\nDelaunay as just as amazing as Vornoi diagrams. As the name suggests, it produces a set of triangles linking our points. These triangles are suc that if one were to draw a circle across the vertices of these triangles, there would be no other point inside the circle (See Figure 10). Moreover, Delaunay triangulation also has the property of maximising the smallest angle of all the angles of the triangles in the triangulation. Hence, Delaunay triangulation tends to avoid triangles with acute angles.\r\n\r\n\r\n\r\nFigure 10: Delaunay triangles are constructed such that no point falls inside the circle circumscribing each triangleSource: Wikipedia\r\n\r\n\r\n\r\nThese properties make it very useful in modelling surfaces and objects from a set of points. For instance, the Delaunay triangulation is used to generate meshes for the finite element method and in facial recognition, construct 3D models for computer animations and model terrain in GIS analysis.\r\n\r\n\r\n\r\nFigure 11: Delaunay triangulation is used to produce meshes for facial recognitionSource: Learn OpenCV\r\n\r\n\r\n\r\nLloyds relaxation algorithm\r\n\r\n\r\nWRITING IN PROGRESS\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-07-08-the-fascinating-world-of-voronoi-diagrams/voronoi_colour_square.png",
    "last_modified": "2021-07-15T17:54:07+02:00",
    "input_file": "voronoi-diagrams-and-delaunay-tesselation.knit.md"
  },
  {
    "path": "posts/2021-06-20-tidycountry/",
    "title": "TidyCountry",
    "description": "I am working on an R package designed to quickly wrangle, merge and explore country data",
    "author": [
      {
        "name": "Francesco S. Bellelli",
        "url": {}
      }
    ],
    "date": "2021-06-20",
    "categories": [
      "coding"
    ],
    "contents": "\r\nTidyCountry\r\nAs an economist, I often work with country-level data coming from different sources. GDP series from the IMF, monetary data from central banks, trade data from WTO, CO2 emissions from the IEA, survey data from national agencies, etc.. Pooling all this data together is often a laborious task because countries’ naming conventions are never the same.\r\nTo make things easier, I am writing an R package to deal with this type of data. Ideally, the user should be able to merge country data files with a unique line of command. The package will offer functionalities to:\r\nConvert country names to a common nomenclature (e.g. M49 standard or ISO-3 codes)\r\nMerge country data in a unique table by recognising and matching different country nomenclatures\r\nSupport the merging of data with multiple identifiers (e.g. panel data or country-sector data)\r\nAutomatically generate interactive visualisations to explore country data\r\n\r\n\r\n\r\n",
    "preview": "https://cdn.britannica.com/13/129613-131-30279F20/Flags-world-flags-Country-history-blog-travel-2009.jpg",
    "last_modified": "2021-07-05T00:05:03+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-04-03-tilemaster-a-strategy-game-in-shiny/",
    "title": "TileMaster: a strategy game in Shiny",
    "description": "I created a small strategy game with RStudios' Shiny platform. If it can run a data dashboard, why not a strategy game?",
    "author": [
      {
        "name": "Francesco S. Bellelli",
        "url": {}
      }
    ],
    "date": "2021-04-03",
    "categories": [
      "coding"
    ],
    "contents": "\r\n\r\n\r\n\r\n\r\ndiv.blue { background-color:#e6f0ff; border-radius: 5px; padding: 20px}\r\n\r\n\r\nA link to the game Tile master is available here.\r\n\r\n\r\n\r\nAfter a look at the amazing gallery of dashboards and interactive data visualisations from Shiny apps, I decided that I had to explore its functionalities by trying a project on my own.\r\nShiny allows R users to quickly build and share simple apps that run on browsers. They are ideal for data visualisation. It is really easy to create interactive charts and combine them in a beautiful dashboards. So why not trying to plot some interesting economic data? I should have thought about this a bit longer. For some inexplicable reason, I decided it would be interesting to implement a strategy board game on a shiny app.\r\nIt was a challenging project. It took some time, and a lot more coding than originally planned, but eventually I managed to implement a playable game with Shiny. For the moment I didn’t write down the games’ rules and didn’t include a tutorial. So, if you don’t mind figuring the rules out by trial and error, feel free to give it a try! No fun is guaranteed.\r\nThis game was an enriching journey. I ended up exploring all sorts of unexpected subjects: from path finding algorithms and Delaunay triangulation to advanced game developing concepts. I also thoroughly enjoyed building the AI for this game. Given the strategic complexity of the game — and being the first AI I ever built — I am quite pleased with the final result. I experimented with different AI approaches, programmatic, machine learning and hybrids. In its final version, the basic AI decision process is a hybrid between a finite-state machine and a utility-based system. I then improved it by training machine learning models to evaluate the AI’s moves.\r\nI implemented many functionalities in the app. Users can save and load games, generate random maps with customisable parameters, select AI difficulty level and even play in a shared-screen multiplayer mode. In the end, it was a great learning project!\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-04-03-tilemaster-a-strategy-game-in-shiny/../../images/tilemaster_screenshot.png",
    "last_modified": "2021-07-05T12:00:29+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-20-how-to-increase-participation-in-environmental-agreements/",
    "title": "How to increase participation in environmental agreements?",
    "description": "Understanding the determinants of participation in environmental agreements can help us frame more successful agreements. In this article, I discuss the economic theory and empirical evidence on this topic.",
    "author": [
      {
        "name": "Francesco S. Bellelli",
        "url": {}
      }
    ],
    "date": "2021-03-20",
    "categories": [
      "environment",
      "economics"
    ],
    "contents": "\r\n\r\nContents\r\nEnvironmental agreements and economic theory\r\nEmpirical evidence\r\n\r\n\r\ndiv.blue { background-color:#e6f0ff; border-radius: 5px; padding: 20px;}\r\n\r\n\r\n\r\nFigure 1: Number of multilateral environmental agreements by year Data from Mitchell (2020)\r\n\r\n\r\n\r\nThe world is facing significant environmental challenges, most of which are transboundary. Air pollution, contamination of lakes and rivers, global warming, biodiversity loss, deforestation, desertification, or overfishing are all problems that cross national borders and require international cooperation. Currently, the primary cooperative tools at our disposal are international environmental agreements, such as the Paris agreement on climate change, the CITES agreement on the trade of endangered species, or the Montreal protocol on ozone-depleting substances.\r\nOver the last fifty years, the number of environmental agreements has exploded (Figure 1). To date, more than 3,000 environmental agreements have been identified (Mitchell 2020) embodying cooperation on the most disparate environmental issues (Figure 2). Some agreements are successful, while others fail. Some attract universal participation, while others die on the negotiation table. Now more than ever, environmental agreements play a crucial role in improving environmental protection worldwide. Hence, the following questions are of great interest to economists: What motivates participation in environmental agreements? How can participation in environmental agreements be increased? Is there any factor at the national level that systematically enhance participation rates? If so, how can policy makers intervene to improve the likelihood of solving transboundary and global environmental issues?\r\n\r\n\r\n\r\nFigure 2: Number of agreements by subject Data from Mitchell (2020)\r\n\r\n\r\n\r\nEnvironmental agreements and economic theory\r\nThese questions have been addressed in economic research mostly using game-theoretical approaches in models that predict both the optimal emission abatement and participation levels in international agreements. In these models, countries contend with a considerable incentive to free-ride because the benefits of the agreement are usually considered non-excludable and non-rival. Hence, the conclusions of classic game-theoretical models are generally pessimistic on the capacity to solve environmental problems. In these models, wide participation in agreements can only be achieved with low abatement targets that fall short of the social optimum. This outlook originates from the core assumptions of these models, which frame treaty participation as a one-off non-cooperative choice — just like in a prisoner’s dilemma.\r\nLater works largely confirmed the free-riding incentive existing in treaty participation, with some improvement in the participation outlook. For example, participation can be improved if participants can offer side transfers. Under the right circumstances also the inclusion of penalties, trade restriction, minimum participation rules and permit trading schemes can considerably boost participation. Moreover, in repeated games — which allow countries to join the agreement in different moments — the result are generally more optimistic than in one-off games.\r\nEmpirical evidence\r\nThanks to the collection of large catalogues of environmental agreements (e.g. Mitchell 2020; CIESIN 2013), scholars can now look at these questions from an empirical perspective. Several findings emerge from this line of enquiry.\r\nFirst of all, the success of an agreement depends primarily on its content. This is by far the most important factor. More stringent agreement tend to deter participation, but there are some type of clauses (e.g.monitoring and enforcement rules, minimum participation rules, technological transfers, financial assistance) which can deliver stronger environmental commitment without penalising participation. Moreover, in Bellelli, Scarpa, and Aftab (2021), I show that regional agreements attract consistently higher ratification rates — on average the probability of joining a regional agreement is 2.5 times higher than for international agreements.\r\n\r\n\r\n\r\nFigure 3: Number of IEA ratifications by 2017 Data from Bellelli, Scarpa, and Aftab (2021)\r\n\r\n\r\n\r\nSo, design of the agreement matters. But this does not tell the whole story. As shown in the map above, participation varies not only between environmental agreements, but also between countries. And these differences are not random, rather, they seem to be clustered geographically, suggesting that political and economic factors are at play. The level of income, the quality of political institutions, the trade profile of the country, electoral and constitutional rules, the economic interests of domestic agents, are all factors that may influence a countries’ participation in international agreements.\r\nFinally, participation choices are seen as a strategic moves, which do not only depend on the characteristics of the country and treaty, but also on the behaviour of foreign nations. While we would theoretically expect a free-riding attitude, empirical evidence suggests that free-riding incentives are mitigated by the presence of international linkages. Empirical findings show that ratification likelihood increases when foreign nations decide to participate in treaties. This is particularly true in the case of large nations and countries that are in the same geographical area or income bracket. The empirical literature agrees that this effect is partly explained by the existence of economic and political ties between countries, which create interdependence and reputational costs for non-participation.\r\n\r\nMore information on this topic may be found in:\r\nBellelli, F.S., Scarpa, R. and Aftab, A. (2021) The joining dilemma: A survey of the empirical literature on environmental treaty participation. Review of Environmental Economics and Policy. (Forthcoming) PDF Appendix\r\nBellelli, F.S., Scarpa, R. and Aftab, A. Interest groups and participation in international environmental agreements. Working paper. Available from https://fbellelli.com/research.html. PDF\r\n\r\n\r\n\r\n\r\nBellelli, Francesco Saverio, Riccardo Scarpa, and Ashar Aftab. 2021. “Interest Groups and Participation in International Environmental Agreements.” Working Paper.\r\n\r\n\r\nCIESIN. 2013. “Environmental Treaties and Resource Indicators (ENTRI).” Center for International Earth Science Information Network.\r\n\r\n\r\nMitchell, R. B. 2020. “International Environmental Agreements Database Project.” University of Oregon.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-03-20-how-to-increase-participation-in-environmental-agreements/map-number-ratifications.png",
    "last_modified": "2021-07-14T16:02:51+02:00",
    "input_file": "welcome.knit.md"
  },
  {
    "path": "posts/2021-01-27-watercolours/",
    "title": "Watercolours",
    "description": "A gallery displaying some of the artistic creations of Francesco and Lily",
    "author": [
      {
        "name": "Francesco S. Bellelli",
        "url": {}
      },
      {
        "name": "Lily Runkun Tian",
        "url": {}
      }
    ],
    "date": "2021-01-27",
    "categories": [
      "other"
    ],
    "contents": "\r\n\r\n\r\n\r\n\r\nClick on any picture to enlarge it\r\n\r\n\r\n\r\n\r\n\r\n#lightgallery > a > img:hover {\r\n   transform: scale(1.15, 1.15);\r\n   transition: 0.2s ease-in-out;\r\n   cursor: pointer;\r\n}\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n    lightGallery(document.getElementById('lightgallery'));\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-27-watercolours/paintings/squirrel.jpeg",
    "last_modified": "2021-07-04T23:23:58+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-20-mappa-licita-naturale/",
    "title": "Mappa licita naturale",
    "description": "Mappa di un sistema di licita naturale lungo-corto a bridge",
    "author": [
      {
        "name": "Francesco S. Bellelli",
        "url": {}
      }
    ],
    "date": "2021-01-20",
    "categories": [
      "other"
    ],
    "contents": "\r\n\r\n\r\n\r\n\r\ndiv.blue { background-color:#e6f0ff; border-radius: 5px; padding: 20px; margin: auto; width: 50%}\r\n\r\n\r\nScaricare immagine: SVG\r\n\r\n\r\n\r\nVersione zoomabile\r\n\r\n\r\n\r\n\r\n* {box-sizing: border-box;}\r\n\r\n.img-zoom-container {\r\n  position: relative;\r\n}\r\n\r\n.img-zoom-lens {\r\n  position: absolute;\r\n  border: 1px solid #d4d4d4;\r\n  /*set the size of the lens:*/\r\n  width: 50px;\r\n  height: 50px;\r\n}\r\n\r\n.img-zoom-result {\r\n  border: 1px solid #d4d4d4;\r\n  /*set the size of the result div:*/\r\n  width: 500px;\r\n  height: 500px;\r\n}\r\n\r\n\r\n\r\nfunction imageZoom(imgID, resultID) {\r\n  var img, lens, result, cx, cy;\r\n  img = document.getElementById(imgID);\r\n  result = document.getElementById(resultID);\r\n  /* Create lens: */\r\n  lens = document.createElement(\"DIV\");\r\n  lens.setAttribute(\"class\", \"img-zoom-lens\");\r\n  /* Insert lens: */\r\n  img.parentElement.insertBefore(lens, img);\r\n  /* Calculate the ratio between result DIV and lens: */\r\n  cx = result.offsetWidth / lens.offsetWidth;\r\n  cy = result.offsetHeight / lens.offsetHeight;\r\n  /* Set background properties for the result DIV */\r\n  result.style.backgroundImage = \"url('\" + img.src + \"')\";\r\n  result.style.backgroundSize = (img.width * cx) + \"px \" + (img.height * cy) + \"px\";\r\n  /* Execute a function when someone moves the cursor over the image, or the lens: */\r\n  lens.addEventListener(\"mousemove\", moveLens);\r\n  img.addEventListener(\"mousemove\", moveLens);\r\n  /* And also for touch screens: */\r\n  lens.addEventListener(\"touchmove\", moveLens);\r\n  img.addEventListener(\"touchmove\", moveLens);\r\n  function moveLens(e) {\r\n    var pos, x, y;\r\n    /* Prevent any other actions that may occur when moving over the image */\r\n    e.preventDefault();\r\n    /* Get the cursor's x and y positions: */\r\n    pos = getCursorPos(e);\r\n    /* Calculate the position of the lens: */\r\n    x = pos.x - (lens.offsetWidth / 2);\r\n    y = pos.y - (lens.offsetHeight / 2);\r\n    /* Prevent the lens from being positioned outside the image: */\r\n    if (x > img.width - lens.offsetWidth) {x = img.width - lens.offsetWidth;}\r\n    if (x < 0) {x = 0;}\r\n    if (y > img.height - lens.offsetHeight) {y = img.height - lens.offsetHeight;}\r\n    if (y < 0) {y = 0;}\r\n    /* Set the position of the lens: */\r\n    lens.style.left = x + \"px\";\r\n    lens.style.top = y + \"px\";\r\n    /* Display what the lens \"sees\": */\r\n    result.style.backgroundPosition = \"-\" + (x * cx) + \"px -\" + (y * cy) + \"px\";\r\n  }\r\n  function getCursorPos(e) {\r\n    var a, x = 0, y = 0;\r\n    e = e || window.event;\r\n    /* Get the x and y positions of the image: */\r\n    a = img.getBoundingClientRect();\r\n    /* Calculate the cursor's x and y coordinates, relative to the image: */\r\n    x = e.pageX - a.left;\r\n    y = e.pageY - a.top;\r\n    /* Consider any page scrolling: */\r\n    x = x - window.pageXOffset;\r\n    y = y - window.pageYOffset;\r\n    return {x : x, y : y};\r\n  }\r\n}\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nimageZoom(\"myimage\", \"myresult\");\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-20-mappa-licita-naturale/BRIDGE sistema naturale.svg",
    "last_modified": "2021-07-05T11:56:27+02:00",
    "input_file": {}
  }
]
